In [ ]:
import pandas as pd

ob = pd.Series([5.2, -4, 99, 0, 100])

ob

RangeIndex(start=0, stop=5, step=1)

In [ ]:
print(ob.index)
print(ob.values)

RangeIndex(start=0, stop=5, step=1)
[  5.2  -4.   99.    0.  100. ]

In [ ]:
print(ob[2:4])

2    99.0
3     0.0
dtype: float64

In [ ]:
import pandas as pd

ob = pd.Series([50, -40, 99, 0, 100], index = ['서울', '대전', '광주', '부산', '속초'])

print(ob.index)
print(ob['서울'])
print(ob[['서울', '부산']])

Index(['서울', '대전', '광주', '부산', '속초'], dtype='object')
50
서울    50
부산     0
dtype: int64

In [ ]:
print(ob.index)
print(ob.values)

Index(['서울', '대전', '광주', '부산', '속초'], dtype='object')
[  5.2  -4.   99.    0.  100. ]

In [ ]:
print(ob[2:4])

광주    99.0
부산     0.0
dtype: float64

In [ ]:
print(ob[ob>50])
print(ob[ob<0])

광주     99.0
속초    100.0
dtype: float64
대전   -4.0
dtype: float64

In [ ]:
import pandas as pd

ob = pd.Series([50, 99, 100, 99, 85], index = ['서울', '대전', '광주', '부산', '속초'])

for i, v in ob.items():
  print('%s : %d 명' %(i, v))

서울 : 50 명
대전 : 99 명
광주 : 100 명
부산 : 99 명
속초 : 85 명

In [ ]:
import pandas as pd

ob = pd.Series({'서울' : 50, '대전' : 99, '부산' : 100}, index = ['서울', '대전', '광주', '부산', '속초'])

ob

서울     50.0
대전     99.0
광주      NaN
부산    100.0
속초      NaN
dtype: float64

In [ ]:
import pandas as pd

data = {'이름' : ['유재석', '조세호', '양세형'], '아이디' : ['uuu', 'jjj', 'yyy'], '비밀번호' : ['1111', '2222', '3333']}

df = pd.DataFrame(data)
df

    이름  아이디  비밀번호
0  유재석  uuu  1111
1  조세호  jjj  2222
2  양세형  yyy  3333

In [ ]:
import pandas as pd

data = {'이름' : ['유재석', '조세호', '양세형'], '아이디' : ['uuu', 'jjj', 'yyy'], '비밀번호' : ['1111', '2222', '3333']}

df = pd.DataFrame(data, index = ['유', '조', '양'])
df

    이름  아이디  비밀번호
유  유재석  uuu  1111
조  조세호  jjj  2222
양  양세형  yyy  3333

In [ ]:
df.loc['조', '비밀번호']

'2222'

In [ ]:
df.loc['유', ['아이디', '비밀번호']]

아이디      uuu
비밀번호    1111
Name: 유, dtype: object

In [ ]:
import pandas as pd

scores = {'이름' : ['유재석', '조세호', '양세형'], '국어' : [100, 90, 80], '영어' : [77, 88, 99], '수학' : [93, 92, 95]}
df = pd.DataFrame(scores)

df

    이름   국어  영어  수학
0  유재석  100  77  93
1  조세호   90  88  92
2  양세형   80  99  95

In [ ]:
new_df = df.iloc[:, [1, 2, 3]]

new_df

    국어  영어  수학
0  100  77  93
1   90  88  92
2   80  99  95

In [ ]:
total = new_df.sum() #세로로 더함

total

국어    270
영어    264
수학    280
dtype: int64

In [ ]:
total = new_df.sum(axis = 1) #가로로 더함

total

0    270
1    270
2    274
dtype: int64

In [ ]:
avg = new_df.mean(axis = 1)

avg

0    90.000000
1    90.000000
2    91.333333
dtype: float64

In [ ]:
for i in range(3):
  print('%s %d %.2f' %(df.iloc[i, 0], total.iloc[i], avg.iloc[i]))

유재석 270 90.00
조세호 270 90.00
양세형 274 91.33